it works!
the plan output shows a string for `reserved_virtual_services` as you wrote
```
  # module.nsxt[0].vcd_nsxt_alb_edgegateway_service_engine_group.seg1[0] will be created
  + resource "vcd_nsxt_alb_edgegateway_service_engine_group" "seg1" {
      + deployed_virtual_services = (known after apply)
      + edge_gateway_id           = "urn:vcloud:gateway:a345d189-4001-4a14-d4b1-69f970f97b9c"
      + id                        = (known after apply)
      + max_virtual_services      = 4
      + reserved_virtual_services = "0"
      + service_engine_group_id   = "urn:vcloud:serviceEngineGroup:048b5f13-0d12-45bd-a9ac-12c63c12ed78"
      + service_engine_group_name = (known after apply)
      + vdc                       = (known after apply)
    }
```
and the `"minVirtualServices": 0` is present in the POST JSON body.
```
2022/10/27 11:05:52 POST https://selfdcvcloud.nuvolaitaliana.it/cloudapi/1.0.0/loadBalancer/serviceEngineGroups/assignments/
2022/10/27 11:05:52 --------------------------------------------------------------------------------
2022/10/27 11:05:52 Req header:
2022/10/27 11:05:52 	User-Agent: [terraform-provider-vcd/v3.5.0-97-g4d951aa5 (linux/amd64; isProvider:true)]
2022/10/27 11:05:52 	X-Vmware-Vcloud-Access-Token: [********]
2022/10/27 11:05:52 	Authorization: [********]
2022/10/27 11:05:52 	X-Vmware-Vcloud-Token-Type: [Bearer]
2022/10/27 11:05:52 	Accept: [application/json;version=36.0]
2022/10/27 11:05:52 	Content-Type: [application/json]
2022/10/27 11:05:52 Request data: [260]
{
  "gatewayRef": {
    "id": "urn:vcloud:gateway:a345d189-4001-4a14-d4b1-69f970f97b9c"
  },
  "serviceEngineGroupRef": {
    "id": "urn:vcloud:serviceEngineGroup:048b5f13-0d12-45bd-a9ac-12c63c12ed78"
  },
  "maxVirtualServices": 4,
  "minVirtualServices": 0
}

```